package interview;

/**
 * 64匹马8赛道确定前4名最少轮数
 */
public class LeastRound {

    /**
     * 最少10/11轮可以确定前4名
     * 前八轮：分出8组（8*8），确定出每组前4名
     * 第九轮：每组第一名比赛确定前4名，此时剩下第一名组4匹、第二名组3匹、第三名组2匹、第四名组1匹，总共10匹马可以竞赛，且第一名组第一名一定是第一
     * 第十/十一轮：剩下9匹通过分析发现需要一轮或者两轮
     *
     * 我们转化（B+1C+2D+3）一下更便于理解：2A>3A>4A，2B>3B/3C、3B>4B、3C>4C/4D
     * 此时234名只有15种方式：
     * 2A/B>2A/B>3A/B/C、2A>3A>2B、2B>3B/C>2A、2B>3B/C>3B/C
     * 2A>3A>4A，2B>3B>4B，2B>3C>4C/D
     *
     * C组12、第四名组1匹简称D组1
     * 此时通过上述9轮可以得到关系：2A>3A>4A，1B>2B>3B，1C>2C，1B>1C>1D
     * 取出这时的前三名、总共15种可能性：
     * 2A 1B (3A、2B、1C)
     * 2A 3A (1B、4A)
     * 1B 2A (3A、2B、1C)
     * 1B 2B (2A、1C、3B)
     * 1B 1C (2A、2B、2C、1D)
     * 选择一匹不比赛，其中前四名概率：
     * 1B：14/15
     * 2A：10/15
     * 1C：7/15
     * 2B：6/15
     * 3A：4/15
     * 4A、3B、2C、1D：1/15
     * 可以算出最少一轮/两轮可以选出全4名，所以最少10轮，最多11轮
     */
}
