package codefroces.brushQuestions.fantastic;

import java.io.*;
import java.util.*;

/**
 * @author gusixue
 * @description C. Intercepting Butterflies
 * @date 2025/11/4 4:26 上午
 *
 * 爱丽丝有一个整数𝑥，其中 1≤𝑥≤2¹⁵，她需要将其发送给鲍勃（月球上的一名宇航员），因为这是他们在月球上的秘密项目的一个重要参数。幸运的是，爱丽丝有一个秘密存储设备𝑆，它包含集合 {1,2,…,20} 的一个不一定非空的子集。她计划将𝑆发送给鲍勃。鲍勃的目标是仅使用𝑆来恢复𝑥的值。
 * 然而，在爱丽丝通过宇宙飞船发送集合𝑆之后，在鲍勃收到𝑆之前，魔法蝴蝶拦截了这艘宇宙飞船！当鲍勃最终收到𝑆时，可能发生了以下情况之一：
 *     * 从𝑆中移除了一个任意元素。这只有在𝑆非空时才能进行。
 *     * 向𝑆中添加了一个任意元素。添加后仍需满足𝑆⊆{1,2,…,20}。
 *     * 𝑆保持不变。
 * 请设计一个爱丽丝和鲍勃的策略，让鲍勃无论𝑆发生了什么情况，都能确定𝑥的值。具体来说，在这个问题中，你的代码将在每个测试上恰好运行两次。第一次运行时，你将扮演爱丽丝；第二次运行时，你将扮演鲍勃。除了集合𝑆之外，不能有任何其他信息从爱丽丝传递给鲍勃。要获得 “通过” 的判定，你第二次运行的代码必须能够准确恢复第一次运行时接收到的整数。
 *
 * 第一次运行
 * 输入
 *     * 第一行输入包含字符串 “first”。这是为了让你的程序识别出这是第一次运行，此时它应扮演爱丽丝。
 *     * 第二行输入包含恰好一个整数𝑡（1≤𝑡≤10⁴）—— 测试用例的数量。
 *     * 第𝑖个测试用例的唯一一行包含一个整数𝑥（1≤𝑥≤2¹⁵）。
 * 输出
 *     * 对于每个测试用例，通过按以下方式打印两行来向鲍勃发送𝑆：
 *     * 第一行输出一个整数𝑛（0≤𝑛≤20）——𝑆的大小。
 *     * 第二行输出𝑛个用空格分隔的整数𝑆₁,𝑆₂,…,𝑆ₙ（1≤𝑆ᵢ≤20）。
 *     * 特别地，如果𝑛=0，你可以省略第二行。你可以按任意顺序输出𝑆的元素，但它们必须两两不同。
 *     * 然后，你将继续处理下一个测试用例，或者如果处理完所有测试用例，你的程序必须终止。
 * 第二次运行
 * 输入
 *     * 第一行输入包含字符串 “second”。这是为了让你的程序识别出这是第二次运行，此时它应扮演鲍勃。
 *     * 第二行输入包含恰好一个整数𝑡（1≤𝑡≤10⁴）—— 测试用例的数量。请注意，这个数字与第一次运行输入中的𝑡相等。
 *     * 每个测试用例的第一行包含一个整数𝑛′（0≤𝑛′≤20）—— 鲍勃收到的集合𝑆′的大小，即可能被修改过的𝑆。
 *     * 每个测试用例的第二行包含𝑛个整数𝑆₁′,𝑆₂′,…,𝑆ₙ′（1≤𝑆ᵢ′≤20）—— 鲍勃收到的𝑆′的元素。𝑆′的元素按升序排列，即使原始的𝑆不是按升序排列的。
 *     * 请注意，第二次运行中的测试用例可能是打乱顺序的。更多细节请参见示例输入。
 * 输出
 *     * 对于每个测试用例，打印一行，输出𝑥的值（1≤𝑥≤2¹⁵）。
 */

public class Testing_Round_20_2168C {

    /**
     * 问题可以转化为：仅看二进制下的 1，x-1 范围在 [0, 2^15-1] 可看做 15 位，不重复的 S 可看做 20 位；S 添加/删除一位，可看做翻转一比特的值
     * 然后 S 出现数字代表二进制下 1 出现：将 S 前 15 位当做 x-1 的值；中间 4 位统一成 数字(0-15) 当做前 15 位所有数字 **异或** 后的结果；最后一位当做中间 4 位出现的数字 %2
     * 由于 S 仅能翻转一次，因此三类位置仅有一个位置会出错：S` 前 15 位所有数再次与中间 4 位统一成的数字异或
     *     结果为 0 则错误在最后一位，前 15 位获得的数字正确
     *     否则最后一位一定正确，根据最后一位判断中间 4 位出现是否正确，不正确则前 15 位获得的数字正确
     *         否则根据中间 4 位再次 **异或** 前 15 位所有数字，结果在前 15 位出现过就代表多加了它、否则删除了它
     */
    public static void main(String[] args) throws IOException {
        Scanner sc = new Scanner(System.in);
        String purpose = sc.nextLine();

        if (purpose.equals("first")) {
            int t = sc.nextInt();
            while (t > 0) {
                int x = sc.nextInt();

                int[] res = solveFirst(x);
//                System.out.println(Arrays.toString(res));

                print(res.length);
                printArray(res);

                t--;
            }

        } else {
            int t = sc.nextInt();
            while (t > 0) {
                int n = sc.nextInt();
                int[] s = new int[n];
                for (int i = 0; i < n; i++) {
                    s[i] = sc.nextInt();
                }

                int res = solveSecond(n, s);

                print(res);

                t--;
            }
        }
    }

    private static int[] solveFirst(int x) {
        List<Integer> listRes = new ArrayList<>();

        int xorTotal = 0;
        for (int i = 0; i < 15; i++) {
            if (((x - 1) & (1 << i)) > 0) {
                xorTotal ^= i + 1;
                // S 前 15 位当做 x-1 的二进制值
                listRes.add(i + 1);
            }
        }
//        System.out.println(xorTotal);

        // 中间 4 位统一成 数字(0-15) 当做前 15 位所有数字 **异或** 后的结果
        int xorCnt = 0;
        for (int i = 0; i < 4; i++) {
            if ((xorTotal & (1 << i)) > 0) {
                listRes.add(i + 16);
                xorCnt++;
            }
        }

        // 最后一位当做中间 4 位出现的数字 %2
        if (xorCnt % 2 == 1) {
            listRes.add(20);
        }

        return listRes.stream().mapToInt(Integer::intValue).toArray();
    }

    private static int solveSecond(int n, int[] s) {
        int x = 0;
        int xorTotal = 0;
        int xorTotalMod = 0;
        int xorCnt = 0;
        for (int num : s) {
            if (num <= 15) {
                x += (1 << (num - 1));

            } else if (num < 20) {
                xorTotal += (1 << (num - 16));
                xorCnt++;

            } else {
                xorTotalMod = 1;
            }
        }

        // S` 前 15 位所有数再次与中间 4 位统一成的数字异或,结果为 0 则错误在最后一位
        int xorTotalTemp = xorTotal;
        for (int num : s) {
            if (num > 15) {
                break;
            }

            xorTotalTemp ^= num;
        }
        if (xorTotalTemp == 0) {
            return x + 1;
        }

        // 根据最后一位判断中间 4 位是否正确，不正确则前 15 位获得的数字正确
        if (xorCnt % 2 != xorTotalMod) {
            return x + 1;
        }

        // 否则根据中间 4 位再次 **异或** 前 15 位所有数字，结果在前 15 位出现过就代表多加了它、否则删除了它
        return (x ^ (1 << (xorTotalTemp - 1))) + 1;
    }

    static int MOD = 1_000_000_007;
    static int INF = (int) 1e9;
    static long fact[];
    static BufferedReader br = new BufferedReader(new InputStreamReader(System.in));
    static BufferedWriter bw = new BufferedWriter(new OutputStreamWriter(System.out));
    static StringTokenizer st;

    static String nextToken() throws IOException {
        if (st == null || !st.hasMoreTokens()) {
            st = new StringTokenizer(br.readLine());
        }
        return st.nextToken();
    }

    static void printArray(int arr[]) throws IOException {
        StringBuilder sb = new StringBuilder();
        for (int e : arr) {
            sb.append(e + " ");
        }
        bw.write(sb.toString().trim());
        bw.newLine();
        bw.flush();
    }

    static void print(Object o) throws IOException {
        bw.write(o.toString());
        bw.newLine();
        bw.flush();
    }
}
